Soap/operation/CRYPTO/CRYPTO_Samples/evaluate_CRYPTO_Mandatory.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>ComNr_0062</CommunicationNumber>
            <Requester>Financial_Institution</Requester>
            <OperationExtId>Op_0062</OperationExtId>
            <OperationType>CRYPTO</OperationType>
            <RiskManagementCategory>OP_PK</RiskManagementCategory>
            <SourceOfRiskLevel>EVALUATE</SourceOfRiskLevel>
            <OperationDateTime>2023-09-23T15:09:33+02:00</OperationDateTime>
            <Currency>ETH</Currency>
            <Amount>14.5</Amount>
            <AmountInEuro>1450</AmountInEuro>
            <EuroExchangeRate>14.5</EuroExchangeRate>
            <FinancialFlowDirection>OUTGOING</FinancialFlowDirection>
            <Description>invoice 'eth11142'</Description>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>aaaz00145C9aa785aaz0C3fDd7197B6777b55b8ebc1BfE758fC7</AccountNumber>
                    <Currency>ETH_222</Currency>
                    <BIC>KRYPXX</BIC>
                    <EntityType>ORGANIZATION</EntityType>
                    <Title>RyptoKrypto</Title>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LT93asdasd3520adasd036948858623</AccountNumber>
                    <EntityType>UNKNOWN</EntityType>
                    <Title>GONDO</Title>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>